Tutorials/twoPhase/SodGasLiq-alllin/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingCentralFoam;

startFrom       latestTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         2.0e-4; //0.0001e-05;//5e-4; //0.001e-05;//2e-05;;//2e-4;

deltaT          0.0002e-05;//2e-05;

writeControl    timeStep; //adjustableRunTime;

writeInterval   500; //1e-6;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false; //true;

maxCo           0.005;

maxDeltaT       1;

CourantType     cellCourant;

// ************************************************************************* //
