Tutorials/twoPhase/SodGasLiq-alllin/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 293.15
    volScalarFieldValue p 1e+5
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue Y.Liq 1.0
);

regions
(
    boxToCell
    {
        box ( -1 -1 -1 ) ( 0.5 1  1 );
        fieldValues
        (
            volScalarFieldValue T 293.15
            volScalarFieldValue p 1.0e+5
            volScalarFieldValue Y.Liq 0.0
        );
    }

    boxToCell
    {
        box ( -1 -1 -1 ) ( 0.475 1  1 );
        fieldValues
        (
            volScalarFieldValue T 293.15
            volScalarFieldValue p 1.0e+6
            volScalarFieldValue Y.Liq 0.0
        );
    }
);


// ************************************************************************* //
